--[[
Это многострочный комментарий
который занимает несколько строк.
]]
local x = 10


--[[
Это многострочный комментарий.

Содержит пустую строку между строками комментария.
]]
local y = 20


--[[
Первый комментарий.
-- Это вложенный комментарий
Который тоже будет проигнорирован.
]]
local z = 30

local f = 10  --[[ Это комментарий на той же строке ]]

local --[[ Это комментарий между эллементами]] f --[[который]] = --[[ не влияет на выражение ]]10

--[[
Коментарий содержащий символ
[
]
Который разобьёт этот комментарий на 2 части
]]